cmsis-svd/cmsis-svd/data/Microchip/ATSAML10D.svd
            <register>
               <name>OPAMPCTRL2</name>
               <description>OPAMP2 Control</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Operational Amplifier Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANAOUT</name>
                     <description>Analog Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIAS</name>
                     <description>Bias Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RES2VCC</name>
                     <description>Resistor ladder To VCC</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES2OUT</name>
                     <description>Resistor ladder To Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1EN</name>
                     <description>Resistor 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1MUX</name>
                     <description>Resistor 1 Mux</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RES1MUXSelect</name>
                        <enumeratedValue>
                           <name>OAxPOS</name>
                           <description>Positive inout of OPAMPx</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OAxNEG</name>
                           <description>Negative input of OPAMPx</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA1OUT</name>
                           <description>OPAMP1 output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POTMUX</name>
                     <description>Potentiometer Selection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>POTMUXSelect</name>
                        <enumeratedValue>
                           <name>14R_2R</name>
                           <description>R1 = 14R, R2 = 2R</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12R_4R</name>
                           <description>R1 = 12R, R2 = 4R</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8R_8R</name>
                           <description>R1 = 8R, R2 = 8R</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6R_10R</name>
                           <description>R1 = 6R, R2 = 10R</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4R_12R</name>
                           <description>R1 = 4R, R2 = 12R</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3R_13R</name>
                           <description>R1 = 3R, R2 = 13R</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2R_14R</name>
                           <description>R1 = 2R, R2 = 14R</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R_15R</name>
                           <description>R1 = 1R, R2 = 15R</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXPOS</name>
                     <description>Positive Input Mux Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MUXPOSSelect</name>
                        <enumeratedValue>
                           <name>OA2POS</name>
                           <description>Positive I/O pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA2TAP</name>
                           <description>Resistor ladder 2 taps</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFERENCE_DAC</name>
                           <description>REFERENCE or DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA1OUT</name>
                           <description>OPAMP1 output</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0POS</name>
                           <description>Positive I/O pin OPA0</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA1POS</name>
                           <description>Positive I/O pin OPA1</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0TAP</name>
                           <description>OPAMP0 Resistor Ladder Taps</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RES3TAP</name>
                           <description>Resistor ladder 3 taps</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXNEG</name>
                     <description>Negative Input Mux Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MUXNEGSelect</name>
                        <enumeratedValue>
                           <name>OA0NEG</name>
                           <description>Negative I/O pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0TAP</name>
                           <description>Resistor ladder 0 taps</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFERENCE_DAC</name>
                           <description>REFERENCE or DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0OUT</name>
                           <description>OPAMP0 output</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESCTRL</name>
               <description>Resister Control</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>RES2OUT</name>
                     <description>Resistor ladder To Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1EN</name>
                     <description>Resistor 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1MUX</name>
                     <description>Resistor 1 Mux</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RES1MUXSelect</name>
                        <enumeratedValue>
                           <name>DAC</name>
                           <description>DAC output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFBUF</name>
                           <description>REFERENCE output</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POTMUX</name>
                     <description>Potentiometer Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>POTMUXSelect</name>
                        <enumeratedValue>
                           <name>14R_2R</name>
                           <description>Gain = 0.14</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12R_4R</name>
                           <description>Gain = 0.33</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8R_8R</name>
                           <description>Gain = 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6R_10R</name>
                           <description>Gain = 1.67</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4R_12R</name>
                           <description>Gain = 3</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3R_13R</name>
                           <description>Gain = 4.33</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2R_14R</name>
                           <description>Gain = 7</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R_15R</name>
                           <description>Gain = 15</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>REFBUFLEVEL</name>
                     <description>Reference output voltage level select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>REFBUFLEVELSelect</name>
                        <enumeratedValue>
                           <name>1_1v</name>
                           <description>1.1v</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_25v</name>
                           <description>1.25v</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_6v</name>
                           <description>1.6v</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
